# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример: [2, 3, 4, 5, 6] => [12, 15, 16]; [2, 3, 5, 6] => [12, 15]

l1 = [2, 3, 4, 5, 6]

l2 = []
if len(l1) % 2 == 0:
    for i in range(len(l1) // 2):
        p1 = l1[i] * l1[(-i + len(l1)) - 1]
        # print(p1)
        l2.append(p1)
    print(l2)
else:
    for i in range(len(l1) // 2 + 1):
        p1 = l1[i] * l1[(-i + len(l1)) - 1]
        l2.append(p1)
    print(l2)